app/controllers/places_controller.rb

  def index
    @places = Place.all
---
SELECT "places".* FROM "places"

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("address", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["address", "340 S. Lemon Ave, Walnut, CA 91789"], ["created_at", "2014-10-28 08:12:50.309493"], ["name", "Nate's Home"], ["updated_at", "2014-10-28 08:12:50.309493"]]

    def set_place
      @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = ? LIMIT 1  [["id", 1]]